# LoadComments Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadComments Property
ParameterTypeId Class See Also
---
"Comments"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadComments { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadComments As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadComments {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace